posts/2018-03-19-Pok3r-Mapping.org






#+date: <2018-03-19 00:00>
#+title: Pok3r Mapping

Mapping reference that I'm using on my pok3r keyboard.

To map a key:

- switch to desired layer with =fn + {<,>,?}=.
- =fn + R_Ctrl= to enter programming mode
- enter key you want to remap
- enter key you want to map to
- =pn= to map
- =fn + R_Ctrl= to exit

You can continue mapping in programming mode by hitting key combinations
followed by =pn=.

** Swaps
   :PROPERTIES:
   :CUSTOM_ID: swaps
   :END:

#+begin_src text
esc -> fn + esc fn + esc -> esc

l\_meta -> l\_super l\_super -> l\_meta

 -> backspace backspace ->\\

capslock -> left ctrl left ctrl -> capslock
#+end_src

** R\_Ctrl -> Fn
   :PROPERTIES:
   :CUSTOM_ID: r_ctrl---fn
   :END:

note: this effects only the layer you are on, fn transforms into super
after this.

- unplug keyboard, flip switch 4
- hit fn, then r\_ctrl
- hit pn, pn to keep position
- turn off switch 4

and now we can have nice vim-like arrow keys:

#+begin_src text
fn + h -> fn + j fn + j -> fn + k fn + k -> fn + i
fn + l -> fn + l
#+end_src

swap (the now available) right win alt:

#+begin_src text
r\_meta -> r\_super r\_super -> r\_meta 
#+end_src

When away, here is an autohotkey script to achieve the same (minus the
arrow keys):

#+begin_src ahk
#SingleInstance force

Capslock::Ctrl

::Backspace Backspace::\\

+BS:: KeyWait, Shift Send, {|} Return

LWin::LAlt LAlt::LWin

RWin::RAlt RAlt::RWin
#+end_src
